diff -uprN a/package/kernel/mac80211/ath.mk b/package/kernel/mac80211/ath.mk
--- a/package/kernel/mac80211/ath.mk	2023-12-31 14:27:54.230676094 +0800
+++ b/package/kernel/mac80211/ath.mk	2023-12-31 14:27:27.667655540 +0800
@@ -1,7 +1,6 @@
 PKG_DRIVERS += \
-	ath ath5k ath6kl ath6kl-sdio ath6kl-usb ath9k ath9k-common ath9k-htc \
-	ath10k ath10k-pci ath10k-sdio ath10k-smallbuffers ath11k ath11k-ahb \
-	ath11k-pci ar5523 carl9170 owl-loader wil6210
+	ath ath5k ath6kl ath6kl-sdio ath6kl-usb ath9k ath9k-common ath9k-htc ath10k ath10k-smallbuffers \
+	ath11k ath11k-ahb ath11k-pci carl9170 owl-loader ar5523 wil6210
 
 PKG_CONFIG_DEPENDS += \
 	CONFIG_PACKAGE_ATH_DEBUG \
@@ -13,7 +12,8 @@ PKG_CONFIG_DEPENDS += \
 	CONFIG_ATH9K_TX99 \
 	CONFIG_ATH10K_LEDS \
 	CONFIG_ATH10K_THERMAL \
-	CONFIG_ATH11K_THERMAL \
+	CONFIG_ATH11K_MEM_PROFILE_512MB \
+	CONFIG_ATH11K_MEM_PROFILE_1GB \
 	CONFIG_ATH_USER_REGD
 
 ifdef CONFIG_PACKAGE_MAC80211_DEBUGFS
@@ -56,14 +56,12 @@ config-$(CONFIG_ATH9K_TX99) += ATH9K_TX9
 config-$(CONFIG_ATH9K_UBNTHSR) += ATH9K_UBNTHSR
 config-$(CONFIG_ATH10K_LEDS) += ATH10K_LEDS
 config-$(CONFIG_ATH10K_THERMAL) += ATH10K_THERMAL
-config-$(CONFIG_ATH11K_THERMAL) += ATH11K_THERMAL
+config-$(CONFIG_ATH11K_MEM_PROFILE_512MB) += ATH11K_MEM_PROFILE_512MB
+config-$(CONFIG_ATH11K_MEM_PROFILE_1GB) += ATH11K_MEM_PROFILE_1GB
 
 config-$(call config_package,ath9k-htc) += ATH9K_HTC
-config-$(call config_package,ath10k) += ATH10K
-config-$(call config_package,ath10k-pci) += ATH10K_PCI

-+		.supports_regdb = false,
-+		.idle_ps = false,
-+		.supports_suspend = false,
-+		.hal_params = &ath11k_hw_hal_params_ipq8074,
-+		.single_pdev_only = false,
-+		.cold_boot_calib = true,
-+		.fix_l1ss = true,
-+		.supports_dynamic_smps_6ghz = false,
-+		.alloc_cacheable_memory = true,
-+		.supports_rssi_stats = false,
-+		.fw_wmi_diag_event = false,
-+		.current_cc_support = false,
-+		.dbr_debug_support = true,
-+		.global_reset = false,
-+		.bios_sar_capa = NULL,
-+		.m3_fw_support = false,
-+		.fixed_bdf_addr = true,
-+		.fixed_mem_region = true,
-+		.static_window_map = false,
-+		.hybrid_bus_type = false,
-+		.fixed_fw_mem = false,
-+		.support_off_channel_tx = false,
-+		.supports_multi_bssid = false,
-+
-+		.sram_dump = {},
-+
-+		.tcl_ring_retry = true,
-+		.tx_ring_size = DP_TCL_DATA_RING_SIZE,
-+		.smp2p_wow_exit = false,
-+		.support_fw_mac_sequence = false,
-+	},
- };
- 
- static inline struct ath11k_pdev *ath11k_core_get_single_pdev(struct ath11k_base *ab)
---- a/drivers/net/wireless/ath/ath11k/core.h
-+++ b/drivers/net/wireless/ath/ath11k/core.h
-@@ -142,6 +142,7 @@ enum ath11k_hw_rev {
- 	ATH11K_HW_WCN6855_HW20,
- 	ATH11K_HW_WCN6855_HW21,
- 	ATH11K_HW_WCN6750_HW10,
-+	ATH11K_HW_IPQ5018_HW10,
- };
- 
- enum ath11k_firmware_mode {
-@@ -230,6 +231,13 @@ struct ath11k_he {
- 
- #define MAX_RADIOS 3
- 
-+/* ipq5018 hw param macros */
-+#define MAX_RADIOS_5018	1
-+#define CE_CNT_5018	6
-+#define TARGET_CE_CNT_5018	9
-+#define SVC_CE_MAP_LEN_5018	17
-+#define RXDMA_PER_PDEV_5018	1
-+
- enum {
- 	WMI_HOST_TP_SCALE_MAX   = 0,
- 	WMI_HOST_TP_SCALE_50    = 1,
diff -uprN a/package/kernel/mac80211/patches/ath11k/0020-ath11k-Replace-one-element-array-with-flexible-array.patch b/package/kernel/mac80211/patches/ath11k/0020-ath11k-Replace-one-element-array-with-flexible-array.patch
--- a/package/kernel/mac80211/patches/ath11k/0020-ath11k-Replace-one-element-array-with-flexible-array.patch	1970-01-01 08:00:00.000000000 +0800
+++ b/package/kernel/mac80211/patches/ath11k/0020-ath11k-Replace-one-element-array-with-flexible-array.patch	2023-12-31 14:27:27.551659817 +0800
@@ -0,0 +1,144 @@
+From b2549465cdeac3847487ce88b15ca47c37b60b88 Mon Sep 17 00:00:00 2001
+From: "Gustavo A. R. Silva" <gustavoars@kernel.org>
+Date: Tue, 28 Sep 2021 12:05:44 +0300
+Subject: [PATCH] ath11k: Replace one-element array with flexible-array member
+
+There is a regular need in the kernel to provide a way to declare having a
+dynamically sized set of trailing elements in a structure. Kernel code
+should always use "flexible array members"[1] for these cases. The older
+style of one-element or zero-length arrays should no longer be used[2].
+
+Refactor the code a bit according to the use of a flexible-array member in
+struct scan_chan_list_params instead of a one-element array, and use the
+struct_size() helper.
+
+Also, save 25 (too many) bytes that were being allocated:
+
+$ pahole -C channel_param drivers/net/wireless/ath/ath11k/reg.o
+struct channel_param {
+	u8                         chan_id;              /*     0     1 */
+	u8                         pwr;                  /*     1     1 */
+	u32                        mhz;                  /*     2     4 */
+
+	/* Bitfield combined with next fields */
+
+	u32                        half_rate:1;          /*     4:16  4 */
+	u32                        quarter_rate:1;       /*     4:17  4 */
+	u32                        dfs_set:1;            /*     4:18  4 */
+	u32                        dfs_set_cfreq2:1;     /*     4:19  4 */
+	u32                        is_chan_passive:1;    /*     4:20  4 */
+	u32                        allow_ht:1;           /*     4:21  4 */
+	u32                        allow_vht:1;          /*     4:22  4 */
+	u32                        allow_he:1;           /*     4:23  4 */
+	u32                        set_agile:1;          /*     4:24  4 */
+	u32                        psc_channel:1;        /*     4:25  4 */
+
+	/* XXX 6 bits hole, try to pack */
+
+	u32                        phy_mode;             /*     8     4 */
+	u32                        cfreq1;               /*    12     4 */
+	u32                        cfreq2;               /*    16     4 */
+	char                       maxpower;             /*    20     1 */
+	char                       minpower;             /*    21     1 */
+	char                       maxregpower;          /*    22     1 */
+	u8                         antennamax;           /*    23     1 */
+	u8                         reg_class_id;         /*    24     1 */
+
+	/* size: 25, cachelines: 1, members: 21 */
+	/* sum members: 23 */
+	/* sum bitfield members: 10 bits, bit holes: 1, sum bit holes: 6 bits */
+	/* last cacheline: 25 bytes */
+} __attribute__((__packed__));
+
+as previously, sizeof(struct scan_chan_list_params) was 32 bytes:
+
+$ pahole -C scan_chan_list_params drivers/net/wireless/ath/ath11k/reg.o
+struct scan_chan_list_params {
+	u32                        pdev_id;              /*     0     4 */
+	u16                        nallchans;            /*     4     2 */
+	struct channel_param       ch_param[1];          /*     6    25 */
+
+	/* size: 32, cachelines: 1, members: 3 */
+	/* padding: 1 */
+	/* last cacheline: 32 bytes */
+};
+
+and now with the flexible array transformation it is just 8 bytes:
+
+$ pahole -C scan_chan_list_params drivers/net/wireless/ath/ath11k/reg.o
+struct scan_chan_list_params {
+	u32                        pdev_id;              /*     0     4 */
+	u16                        nallchans;            /*     4     2 */
+	struct channel_param       ch_param[];           /*     6     0 */
+
+	/* size: 8, cachelines: 1, members: 3 */
+	/* padding: 2 */
+	/* last cacheline: 8 bytes */
+};
+
+This helps with the ongoing efforts to globally enable -Warray-bounds and
+get us closer to being able to tighten the FORTIFY_SOURCE routines on
+memcpy().
+
+This issue was found with the help of Coccinelle and audited and fixed,
+manually.
+
+[1] https://en.wikipedia.org/wiki/Flexible_array_member
+[2] https://www.kernel.org/doc/html/v5.10/process/deprecated.html#zero-length-and-one-element-arrays
+
+Link: https://github.com/KSPP/linux/issues/79
+Link: https://github.com/KSPP/linux/issues/109
+Signed-off-by: Gustavo A. R. Silva <gustavoars@kernel.org>
+Signed-off-by: Kalle Valo <kvalo@codeaurora.org>
+Link: https://lore.kernel.org/r/20210823172159.GA25800@embeddedor
+---
+ drivers/net/wireless/ath/ath11k/reg.c | 7 ++-----
+ drivers/net/wireless/ath/ath11k/wmi.c | 2 +-
+ drivers/net/wireless/ath/ath11k/wmi.h | 2 +-
